# RenderingQualitySettings Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RenderingQualitySettings Class
Members See Also
---
Represents the quality settings of rendering.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class RenderingQualitySettings : IDisposable
```

Visual Basic
---
```text
Public Class RenderingQualitySettings _
	Implements IDisposable
```

Visual C++
---
```text
public ref class RenderingQualitySettings : IDisposable
```

# Remarks
The other properties in this class can only be modified if the RenderingQuality property is currently set to Custom.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..RenderingQualitySettings
# See Also
RenderingQualitySettings Members
Autodesk.Revit.DB Namespace